import React, { PureComponent } from 'react';
import { connect } from 'react-redux';
import { ServiceWrapper } from '../style';

class PrivacyPolicy extends PureComponent {

  render () {
    return (
      <ServiceWrapper>
       <div>
            <div style={{"fontSize":"29px","textAlign":"center"}}><b>野猪佩奇招聘用户服务协议</b></div><br/>
            <p>本网站的各项服务的所有权和运作权归野猪佩奇。本网站仅提供求职、招聘信息发布及其他与此相关联之服务。企业用户（或称“使用者”）必须完全同意包括本协议在内的所有服务条款（包括但不限于《用户协议》、《隐私政策》、《法律声明》）、完成注册程序并缴纳完毕全部费用后，才能注册成为本网站的使用者，并遵守本协议所述之条款使用本网站所提供的服务，在注册成为企业用户的同时，您也承认了您拥有购买本网站所提供的服务产品所必须的完全民事权利能力和行为能力，并且您将对您在订单中提供的所有信息的真实性、准确性、合法性和完整性负责。如果您不接受本协议之条款，请勿使用本网站。如您点击确认本协议的，则视为您已经接受本协议之内容。</p>
            <p>本网站保留随时修正本服务条款的权利。如果我们决定改变本网站的企业用户服务协议，我们会在本网站公布改变的内容。除非用户向本网站提出不接受修改并立即终止服务的通知，否则本网站视为用户接受修改后的内容并按照修改后的内容继续享有本网站提供的服务。或者您虽然向本网站提出异议但仍继续使用本网站提供之服务的，则视为您已经同意本网站就用户协议的修改并愿意遵照执行。本网站对上述修改所致的用户的任何不便或损失（如有）不承担任何责任。</p>

			<div ><strong>一、服务声明</strong><br/></div><br/>
            <strong>（一）上网的准备</strong><br/><br/>
            本网站运用自己的操作系统通过国际互联网络为用户提供网络服务。同时，企业用户必须：<br/>
            1、自行配备上网的所需设备，包括个人电脑、调制解调器或其他必备上网装置。<br/>
            2、自行负担上网所支付的与此服务有关的电话费用、网络费用。<br/><br/>
            <strong>（二）信息的发布</strong><br/><br/> 
			本网站只能用于人才招聘相关的合法目的，企业用户在成功注册为企业用户后，仅可就招聘目的（即雇主寻找雇员）在本网站发布招聘信息以及按照本网站为您开设的权限或功能浏览求职者的简历信息。本网站明确禁止将本网站及从本网站获取的信息用于任何其他非人才招聘相关的用途，并要求所有企业用户同意不得使用本网站从事下列任何一种行为：<br/>
			1、发布任何有关法律法规明令禁止发布的信息；<br/>	
			2、发布任何与求职、招聘信息发布之目的不适之信息；<br/>
			3、发布任何职位名称与职位描述不符的信息；<br/>
			4、以任何形式侵犯他人的版权、商标权、商业秘密或其他知识产权；<br/>
			5、侵犯个人和社会大众的隐私安全；<br/>
			6、传输违反任何法律法规及其他规范性文件的信息，包括但不限于属于任何非法的、骚扰性的、中伤性的、辱骂性的、恐吓性的、伤害性、庸俗或淫秽的信息。<br/>
			7、发布虚假、不准确、不完整或具有误导性的职位信息或意见、通知、商业广告或其他与招聘目的不符的内容。<br/>
			8、发布任何违反法律法规及其他规范性文件、具有贬损、侮辱、有违社会公序良俗等的信息或言论；<br/>
			9、利用网站开设的功能或权限发布、编辑、传播等违反法律法规及其他规范性文件、引人反感或有违风化的信息、言论或内容。<br/>
			为了证明企业用户主体资格的真实性，企业用户应当向本网站提供相关证明材料（包括但不限于加盖公章的营业执照副本等），企业用户向本网站不可撤销的承诺其系依法成立的法人、团体或其他法律认可的组织。企业用户保证其向本网站提供的上述证明材料及在本网站发布的信息真实、合法、有效，且对该企业及企业在本网站所发布的信息及借助本网站所实施的全部行为承担完全责任，如因企业用户自身或企业用户所发布的信息违反本协议之规定或者侵犯任何第三方的合法权益引起的一切纠纷或责任，由企业用户自行承担，本网站不承担任何责任且有权向企业用户进行追偿。<br/><br/>
           
            <strong>（三）信息的使用</strong><br/><br/>
            1、本网站提供的其他信息，仅能用于同该信息之相应内容有关的目的，否则，不得作为其他目的使用。本网站享有解释信息使用之目的的权利；<br/>	
            2、本网站信息仅用于满足企业用户自身招聘之目的，企业用户不得将任何本网站的信息用作任何商业目的，也不得未经本网站之许可，向任何其他第三方披露、许可、转让本网站非公开信息或以类似前述之方式使其他第三方所知晓相关信息。<br/>	
            3、企业用户不得将从野猪佩奇所购买的服务产品（包括但不限于简历信息）用于任何除自身招聘以外的其他目的，或以任何方式泄露、授权或变相授权给任何第三方，除非事先获得野猪佩奇的书面同意。<br/><br/>	
            
            <strong>（四）信息的公开</strong><br/><br/>            
            在本网站所发布的任何信息，均有可能被任何本网站的访问者浏览，也可能被错误使用。本网站对前述浏览或错误使用情形将不予承担任何责任。<br/><br/>
            
            <strong>（五）信息的更改与删除</strong><br/><br/>
            除了信息的发布者外，任何访问者不得更改或删除他人发布的任何信息。本网站有权根据判断按照法律法规及其他规范性文件的要求修改或删除任何本网站认为不适合通过本网站发布信息。<br/><br/>

            <strong>（六）在线支付</strong><br/><br/>
            1、在线注册的企业用户通过第三方公司提供的交易系统完成费用的支付，购买服务产品的价格以企业用户在线下单时本网站上公布的价格为准。在前述费用支付完成后，本网站不接受企业用户基于任何理由的退款要求。<br/>
            2、企业用户应明确知晓，本网站有权根据所提供服务之不同设定不同的服务价格，并有权根据市场之需求对价格进行调整。企业用户对购买之服务的价格表示确认或同意的，不得以本网站变更后的价格（如有）向本网站主张索赔或返还一定的金额等。如上述行为发生的，本网站有权不予赔偿或退还用户相应服务费等。<br/>
            3、如企业用户有违反有关法律法规以及本协议的行为，包括但不限于发布有关法律法规或本协议中明令禁止发布的信息，恶意损毁本网站声誉、商誉以及其他违反有关法律法规、本协议以及网站使用规则某一项规定的行为，本网站将有权单方决定中断或终止向企业用户提供服务，本网站将不退还企业用户已支付费用且不承担任何责任，由此给企业用户带来的损失由企业用户自行承担。<br/>
            4、如因不可抗力、提供交易系统的第三方公司原因或其它本网站无法控制的原因导致网上交易无法完成、网站系统崩溃或无法正常使用而使购买的服务中断或丢失有关的信息、记录等，本网站不承担责任。但是本网站会尽可能合理地协助处理善后事宜。<br/><br/>

            <strong>（七）帐号、密码及安全性</strong><br/><br/>            
            企业用户一旦注册成功，成为本网站的企业用户，将得到一个密码和用户名。企业用户可随时改变密码，并负责用户名与密码的安全。企业用户不得将该用户名及密码提供给第三方使用或从事任何可能使用户名、密码存在泄露危险的行为（包括但不限于授权代理登录获取野猪佩奇信息、资料或利用第三方客户端插件及其他不正当手段获取野猪佩奇信息、资料的）。企业用户不得通过自研或授权、默认其他任何第三方利用各种计算机程序或其他任何方式对野猪佩奇网站、手机APP及简历资源、数据库信息等进行任何非正常访问或上述资料的获取、下载等。<br/>
            企业用户对以其用户名进行的所有活动和事件负全责。若企业用户发现任何非法使用用户帐号或存在安全漏洞的情况，请立即通告本网站。企业用户应理解并知悉野猪佩奇采取行动需要合理时间，野猪佩奇对在采取行动前已经产生的后果（包括但不限于企业用户的任何损失）不承担任何责任。<br/><br/>

            <strong>（八）招聘的合法性</strong><br/><br/>  
            1、企业用户应保证其所发布或提供信息的真实性、合法性、有效性，不得冒充他人、不得利用他人的名义发布任何信息。<br/> 
            2、企业用户应保证其招聘行为的合法性，保证不存在任何扣押被录用人员或参加面试人员的居民身份证和其他证件、以担保或其他任何名义向劳动者收取财物或其他以招用人员为名牟取不正当利益等民事或刑事等违法、犯罪行为。若因其招聘行为引发任何第三人投诉或诉讼等情形，应主动采取补救措施、并积极配合野猪佩奇降低和消除事件可能给野猪佩奇造成的影响。<br/> 
            3、企业用户应保证遵守招聘活动秩序，合理使用野猪佩奇提供的物料及资源，因企业用户及其工作人员原因造成野猪佩奇或其他人身或财产损失的，均由企业用户负责全额赔偿。<br/> <br/>

            <strong>(九)网站使用</strong><br/><br/>  
            1、明确的禁止使用<br/>
            Zhaopin.com（含网站及手机APP）只能用于人才招聘相关的合法目的，即个人寻找职业和雇主寻找雇员。Zhaopin.com 明确禁止任何其他非人才招聘相关的用途，并要求所有使用者同意不用于使用Zhaopin.com开展下列任何一种用途：<br/>
            （1）公布不是招聘信息的资料，如意见、通知、商业广告或其他非招聘内容；<br/>
            （2）除发布者外，删除或修改其他个人或公司公布的资料；<br/>
            （3）擅自打印、复制或以其他方式使用有关雇员的任何个人资料或有关雇主的商业信息；<br/>
            （4）未经同意，给公布信息的个人或公司发电子邮件、打电话、寄信或以其他方式进行接触。<br/>
            2、网址安全法规<br/>
            禁止使用者违反安全法规，破坏或企图破坏 Zhaopin.com 的安全法规保护措施，包括但不限于：<br/>
            （1）接触未经许可的数据或进入未经许可的服务器、帐户、邮箱或许可第三方接入未经本网站同意的由本网站发布、输送、传播的数据、简历或其他信息等；<br/>
            （2）没有得到许可，企图探查、扫描或测试系统或网络的弱点或者破坏安全措施；<br/>
            （3）企图干涉对用户及网络的服务，包括但不限于通过超载、“邮件炸弹”或“摧毁”等手段；<br/>
            （4）发送促销、产品广告及服务的email；<br/>
            （5）伪造TCP/IP数据包名称或部分名称。破坏系统或网络可能导致犯罪。Zhaopin.com 将调查此类破坏行为的发生，并可能干预、和执法当局合作起诉犯此类破坏行为的使用者。<br/>
            3、总则<br/>
            严禁从事以下行为：<br/>
            （1）开展违反任何现行法律法规及其他规范性文件的任何活动；<br/>
            （2）侵犯他人的版权、商业机密、或其他知识产权，或侵犯了他人的隐私权、出版权或其他个人合法权利；<br/>
            （3）利用本网站传送、分发、储存违反任何法律法规及其他规范性文件的内容，包括但不限于属于诽谤、淫秽、威胁、辱骂性、毁损他人或其他非法或者违反社会公序良俗的材料；<br/>
            （4）利用本网站提供的服务系统进行任何可能对互联网或移动网正常运转造成不利影响的行为；<br/>
            （5）以任何形式使用本网站提供的服务进行任何不利于本网站的行为。<br/><br/>

            <strong>（十）服务暂停、服务终止</strong><br/><br/>           
            任何一位使用者经Zhaopin.com确定已违反了有关法律法规、本协议或网站使用规则某一项规定，将收到一份书面警告。如果该使用者在接到前述警告后，以书面形式表示自己再也不会有违犯行为，Zhaopin.com有权决定是否继续给予暂停或终止使用的处理。然而，如果本网站认为必要时，也可不提出警告而马上暂停或终止对该使用者的服务。如果我们确定某一使用者再次违犯了网络使用规则的任何一项规定，无需再发通知，该使用者立即受到暂停使用或终止使用的处理。<br/><br/>

            <strong>（十一）法律适用和争议处理</strong><br/><br/>  
            本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律法规。如用户就本协议与本网站及野猪佩奇发生任何争议，应提交野猪佩奇所在地有管辖权的人民法院进行诉讼。<br/><br/>



            <div ><strong>二、法律声明</strong><br/></div><br/>
            <strong>（一）版权</strong><br/><br/>
            此Zhaopin.com网站的内容、图表、版式设计等所呈现出的全部或部分可单独作为作品保护之内容等及维系本网站运营的各种源代码、执行程序、系统均受到中国版权法律、法规及相关国际条约的保护。Zhaopin.com对上述内容拥有一切权利，未经Zhaopin.com同意，不允许全部或部分复制、转载或以其他任何方式使用。禁止以任何目的重新使用Zhaopin.com网上的内容和图表等作品或作品元素。在事先得到野猪佩奇许可，且未对内容和图表等作品、元素进行任何修改的情况下，Zhaopin.com的网上材料可作为网外信息方面和非商业方面的用途。经Zhaopin.com同意后复制、转载或者以其他形式使用本网站相关资料的，应当标明资料来源于“Zhaopin.com”，以及Zhaopin.com或相关第三方拥有该等资料的著作权的字样。<br/>
            申请使用Zhaopin.com内容的许可是按逐个批准的原则进行的。Zhaopin.com欢迎使用者提出申请。请把请求直接提交给webmaster@zhaopin.com。请勿复制或采用Zhaopin.com所创造的用以制成网页的HTML。HTML的版权同样属于Zhaopin.com。<br/>
            Zhaopin.com对其Zhaopin.com网址上的所有图标、图饰、图表、色彩、文字表述及其组合、版面设计、数据库均享有完全的著作权及其衍生的其他全部权利，对发布的信息均享有专有的发布和使用权。<br/><br/>

            <strong>（二）商标</strong><br/><br/>            
            Zhaopin.com的商标，包括Zhaopin.com、Alliance和Zhaopin.com其他网站的商标属于Zhaopin.com所有。Zhaopin.com上业务合作者的商标属于合作者所有。未经Zhaopin.com及/或Zhaopin.com的合作者事先书面许可，不得复制或以任何其他方式使用上述商标。<br/><br/>

            <strong>（三）免责条款</strong><br/><br/>            
            1、使用者理解并同意Zhaopin.com对以下情况免责：<br/>
            （1）应聘信息发布方对存入简历中心的个人简历及材料的格式、内容的真实性、准确性和合法性负有全部责任，招聘信息发布方对于其在职位数据库公布的材料的真实性、准确性和合法性负有全部责任。Zhaopin.com仅是提供职位发布等信息的平台，Zhaopin.com不对应聘及招聘信息的真实性、有效性、准确性负责。<br/>
            （2）Zhaopin.com并不能时时监视此网址，但保留进行随时监视的权利。对于非Zhaopin.com公布的材料，Zhaopin.com一概不负任何责任；<br/>
            （3）Zhaopin.com虽然对用户进行资质审查，但Zhaopin.com并非司法机关，仅能要求用户提交真实、有效的资质证明文件，并对该提交的资质证明文件进行审核。如用户提交虚假、伪造、变造文件的，Zhaopin.com对此概不承担法律责任；<br/>
            （4）Zhaopin.com不对用户的线下行为负责。企业用户及个人用户均应审慎的对待他方之行为，因为他方之行为给用户造成任何不利影响的，Zhaopin.com不承担任何法律责任；<br/>
            （5）为了更好的提升招聘效果Zhaopin.com可能会将您的招聘信息与我们的关联方共享。但我们只会共享必要的信息，且受本协议中所声明目的的约束。Zhaopin.com不能保证某一种职位描述会有一定数目的使用者来浏览，也不能保证会有一位特定的使用者来浏览；<br/>
            （6）Zhaopin.com对由于政府禁令、现行生效的适用法律或法规的变更、火灾、地震、动乱、战争、停电、通讯线路中断、黑客攻击、计算机病毒侵入或发作、电信部门技术调整、因政府管制而造成网站的暂时性关闭等任何影响网络正常运营的不可预见、不可避免、不可克服和不可控制的事件（“不可抗力事件”），以及他人蓄意破坏、Zhaopin.com工作人员的疏忽或不当使用，正常的系统维护、系统升级，或者因网络拥塞而导致Zhaopin.com不能访问而造成的Zhaopin.com所提供的信息及数据的延误、停滞或错误，以及使用者由此受到的一切损失不承担任何责任；<br/>
            （7）由于与Zhaopin.com链接的其他网站或用户所使用的网络运营商所造成之个人资料泄露及由此而导致的任何法律争议和后果均由网站或用户所使用的网络运营商负责；<br/>
            （8）对于Zhaopin.com为使用者提供便利而设置的外部链接网址，Zhaopin.com并不保证其准确性、安全性和完整性，亦并不代表本网站对其链接内容的认可，请使用者谨慎确认后使用，Zhaopin.com对由此导致的任何损失或伤害不承担任何责任。<br/>
            2、除了本网址在隐私政策中提出的条款外，使用者理解并同意Zhaopin.com在不公开用户公司名称/用户个人姓名的情况下，可以向第三方提供综合性的非个人化信息资料。除非：<br/>
            （1）依照法律、法规、法院命令、监管机构命令的要求；<br/>
            （2）根据政府行为、监管要求或请求；<br/>
            （3）因Zhaopin.com其认为系为遵守监管义务或公共目的所需；<br/>
            （4）为免除访问者在生命、身体或财产方面之急迫危险，<br/>
            否则在未经用户事先同意的情况下，Zhaopin.com不会向第三方公开用户的公司名称/姓名、地址、电子邮件和电话等个人信息。<br/><br/>

            <strong>（四）隐私政策</strong><br/><br/>            
            有关Zhaopin.com的隐私政策条款，详见本网站为您提供的“隐私政策”，可通过以下链接查阅：<a href="http://special.zhaopin.com/sh/2009/aboutus/secrecy.html">http://special.zhaopin.com/sh/2009/aboutus/secrecy.html</a>。<br/><br/>
			
			<strong>（五）风险声明</strong><br/><br/>            
            使用者使用本网址须自行承担风险。本网址的材料是按“正如… …的情况”所提供的，对材料不作任何明示的或暗示的保证。除非适用的法律法规有明确规定，Zhaopin.com 及其所属网络对销售性的和适合于某一特定目的的一切保证不予承认。 Zhaopin.com 不能保证材料的特殊目的不受阻挠不出错误，也不能保证错误会得到纠正，也不能保证本网址或制成本网址的材料不含有病毒或其他有害成分。在有关材料的使用或使用结果方面对材料的正确性、准确性、可靠性或其他方面，Zhaopin.com 不作出保证或任何说明。用户（而不是Zhaopin.com ）承担一切必要的服务、修理或改正费用。在适用法规不允许暗含保证可免除承担一切费用的范围里，免除上述承担费用不适用于使用者。<br/><br/>

			<strong>警告</strong><br/><br/>  
			在使用 Zhaopin.com 网络时违背了这些法规将构成对野猪佩奇权利的侵犯或违反，并可导致对您采取法律行动。
</div>
      </ServiceWrapper>
    )
  }
  componentDidMount () {
    window.scrollTo( 0, 0);
  }
};

const mapState = (state) => ({
  
});

const mapDispatch = (dispatch) => {
  return {
    
  }
};

export default connect(mapState,mapDispatch)(PrivacyPolicy);
